Rafa350/EOS/v2/Source/HTL/STM32/htlUART.cpp
#include "HTL/htl.h"
#include "HTL/STM32/htlClock.h"
#include "HTL/STM32/htlUART.h"


using namespace htl;
using namespace htl::uart;


static void setParity(USART_TypeDef *usart, Parity parity);
static void setWordBits(USART_TypeDef *usart, WordBits wordBits, bool useParity);
static void setStopBits(USART_TypeDef *usart, StopBits stopBits);
static void setHandsake(USART_TypeDef *usart, Handsake handsake);
static void setReceiveTimeout(USART_TypeDef *usart, uint32_t timeout);

static bool isTxEmptyInterruptEnabled(USART_TypeDef *usart);
static bool isTxCompleteInterruptEnabled(USART_TypeDef *usart);
static bool isTxEmpty(USART_TypeDef *usart);
static bool isTxComplete(USART_TypeDef *usart);

static bool isRxNotEmptyInterruptEnabled(USART_TypeDef *usart);
static bool isRxNotEmpty(USART_TypeDef *usart);

static void write8(USART_TypeDef *usart, uint8_t data);
static uint8_t read8(USART_TypeDef *usart);

static ClockSource getClockSource(USART_TypeDef *usart);
static unsigned getClockFrequency(USART_TypeDef *usart, ClockSource clockSource);


/// ----------------------------------------------------------------------
/// \brief    Constructor.
/// \param    usart: Registres hardware del modul USART.
///
UARTDevice::UARTDevice(
	USART_TypeDef *usart):

	_usart {usart},
	_state {State::reset},
	_notifyEvent {nullptr},
	_notifyEventEnabled {false},
	_dmaNotifyEvent {*this, &UARTDevice::dmaNotifyEventHandler} {

}


/// ----------------------------------------------------------------------
/// \brief    Inicialitza el modul UART.
/// \return   El resultat de l'operacio.
///
Result UARTDevice::initialize() {

    // Comprova que l'estat sigui 'reset'
    //
	if (_state == State::reset) {

	    // Activa el dispositiu
	    //
		activate();

		// Desabilita les comunicacions.
		//
		disable();

        #if defined(EOS_PLATFORM_STM32G0)
		_usart->CR1 &= ~USART_CR1_FIFOEN;
        #endif
	    _usart->CR2 &= ~(USART_CR2_LINEN | USART_CR2_CLKEN);
		_usart->CR3 &= ~(USART_CR3_SCEN | USART_CR3_HDSEL | USART_CR3_IREN);

		// Canvia l'estat a 'ready'
		//
		_state = State::ready;

		return Result::success();
	}

	else
		return Result::error();
}


/// ----------------------------------------------------------------------
/// \brief    Desinicialitza el modul.
/// \return   El resultat de l'operacio.
///
Result UARTDevice::deinitialize() {

    // Comprova que l'estat sigui 'ready'
    //
	if (_state == State::ready) {

	    // Deshabilita les comunicacions
	    //
		disable();

		// Desactiva el dispositiu
		//
		deactivate();

		// Canvia l'estat a 'reset'
		//
		_state = State::reset;

		return Result::success();
	}

	else
		return Result::error();
}


/// ----------------------------------------------------------------------
/// \brief    Selecciona el protocol de comunicacio.
/// \param    wordBits: Lers opcions de paraula.
/// \param    parity: Les opcions de paritat.
/// \param    stopBits: Les opcions de parada.
/// \param    handsake: Protocol.
///
void UARTDevice::setProtocol(
	WordBits wordBits,
	Parity parity,
	StopBits stopBits,
	Handsake handsake) {

	setParity(_usart, parity);
	setWordBits(_usart, wordBits, parity != Parity::none);
	setStopBits(_usart, stopBits);
	setHandsake(_usart, handsake);
	setReceiveTimeout(_usart, 11 * 100);
}


void UARTDevice::setRxTimeout(
    uint32_t timeout) {

    setReceiveTimeout(_usart, timeout);
}



/// ----------------------------------------------------------------------
/// \brief    Asigna els valor de temporitzacio.
/// \param    baudMode: Les opcions del baud rate
/// \param    clockSource: Les opcions de clocking.
/// \param    rate: El valor de velocitat.
/// \param    overSampling: Tipus de mostreig
///
void UARTDevice::setTimming(
	BaudMode baudMode,
	ClockSource clockSource,
	uint32_t rate,
	OverSampling overSampling) {

	switch (baudMode) {
    	case BaudMode::_1200:
    		rate = 1200;
    		break;

    	case BaudMode::_2400:
    		rate = 2400;
    		break;

    	case BaudMode::_4800:
    		rate = 4800;
    		break;

    	case BaudMode::_9600:
    		rate = 9600;
    		break;

    	case BaudMode::_19200:
    		rate = 19200;
    		break;

    	case BaudMode::_38400:
    		rate = 38400;
    		break;

    	case BaudMode::_57600:
    		rate = 57600;
    		break;

    	case BaudMode::_115200:
    		rate = 115200;
    		break;

    	default:
    		break;
    }

    if (clockSource == ClockSource::automatic)
    	clockSource = getClockSource(_usart);

    uint32_t fclk = getClockFrequency(_usart, clockSource);

    uint32_t div;
    if (baudMode == BaudMode::div)
    	div = rate;
    else {
        if (overSampling == OverSampling::_8)
        	div = (fclk + fclk + (rate / 2)) / rate;
        else
           	div = (fclk + (rate / 2)) / rate;
    }

    if (overSampling == OverSampling::_8) {
        uint32_t temp = (uint16_t)(div & 0xFFF0U);
        temp |= (uint16_t)((div & (uint16_t)0x000FU) >> 1U);
        _usart->BRR = temp;
    }
    else
    	_usart->BRR = div;
}


/// ----------------------------------------------------------------------
/// \brief    Asigna l'event de notificacio.
/// \param    event: L'event.
/// \param    enabled: Indica si l'habilita.
///
void UARTDevice::setNotifyEvent(
	INotifyEvent &event,
	bool enabled) {

	_notifyEvent = &event;
	_notifyEventEnabled = enabled;
}


/// ----------------------------------------------------------------------
/// \brief    Inicia la transmissio d'un bloc de dades per interrupcions.
/// \param    buffer: Buffer de dades.
/// \param    bufferSize: El nombre de bytes en el buffer.
/// \return   El resultat de l'operacio
///
Result UARTDevice::transmit_IRQ(
	const uint8_t *buffer,
	unsigned bufferSize) {

	if (_state == State::ready) {

		_state = State::transmiting;

		_txBuffer = buffer;
		_txSize = bufferSize;
		_txCount = 0;

		// Habilita les interrupcions i activa la transmissio
		//
        #if defined(EOS_PLATFORM_STM32F7)
        ATOMIC_SET_BIT(_usart->CR1, USART_CR1_TXEIE | USART_CR1_TE);
        #elif defined(EOS_PLATFORM_STM32G0)
		ATOMIC_SET_BIT(_usart->CR1, USART_CR1_TXEIE_TXFNFIE | USART_CR1_TE);
        #endif

		return Result::success();
	}

	else if ((_state == State::transmiting) || (_state == State::receiving))
		return Result::busy();

	else
		return Result::error();
}


