Rafa350/EOS/v2/Source/HTL/STM32/htlUART.cpp
/// ----------------------------------------------------------------------
/// \brief    Inicia la recepcio d'un bloc de dades per interrupcions.
/// \param    buffer: Buffer de dades.
/// \param    bufferSize: Tamany del buffer en bytes.
/// \return   El resultat de l'operacio.
///
Result UARTDevice::receive_IRQ(
	uint8_t *buffer,
	unsigned bufferSize) {

	if (_state == State::ready) {

		_state = State::receiving;

		_rxBuffer = buffer;
		_rxSize = bufferSize;
		_rxCount = 0;

        #if defined(EOS_PLATFORM_STM32F7)
        ATOMIC_SET_BIT(_usart->CR1, USART_CR1_RXNEIE | USART_CR1_RE);
        #elif defined(EOS_PLATFORM_STM32G0)
		ATOMIC_SET_BIT(_usart->CR1, USART_CR1_RXNEIE_RXFNEIE | USART_CR1_RE);
        #endif

		return Result::success();
	}

	else if ((_state == State::transmiting) || (_state == State::receiving))
		return Result::busy();

	else
		return Result::error();
}


/// ----------------------------------------------------------------------
/// \brief    Transmiteix un bloc de dades utilitzant DMA.
/// \param    devDMA: Dispositiu DMA.
/// \param    buffer: Buffer de dades.
/// \param    bufferSize: El nombre de bytes en el buffer.
/// \return   El resultat de l'operacio
///
Result UARTDevice::transmit_DMA(
    dma::DMADevice *devDMA,
    const uint8_t *buffer,
    unsigned bufferSize) {

    if (_state == State::ready) {

        _state = State::transmiting;

        _txBuffer = buffer;
        _txSize = bufferSize;
        _txCount = 0;

        // Habilita les interrupciuons i habilita la transmissio per DMA
        //
        _usart->ICR &= ~USART_ICR_TCCF;
        ATOMIC_SET_BIT(_usart->CR1, USART_CR1_TE);
        ATOMIC_SET_BIT(_usart->CR3, USART_CR3_DMAT);

        // Inicia la transferencia per DMA
        //
        devDMA->setNotifyEvent(_dmaNotifyEvent, true);
        devDMA->start(buffer, (uint8_t*)&(_usart->TDR), bufferSize);

        return Result::success();
    }

    else if ((_state == State::transmiting) || (_state == State::receiving))
        return Result::busy();

    else
        return Result::error();
}


/// ----------------------------------------------------------------------
/// \brief    Reb un bloc de dades utilitzan DMA.
/// \param    devDMA: El dispositiu DMA.
/// \param    buffer: El buffer de dades.
/// \param    bufferSize: El tamany del buffer en bytes.
/// \return   El resultat de l'operacio.
///
Result UARTDevice::receive_DMA(
    dma::DMADevice *devDMA,
    uint8_t *buffer,
    unsigned bufferSize) {

	return Result::error();
}


/// ----------------------------------------------------------------------
/// \brief    Procesa les interrupcions.
///
#if defined(EOS_PLATFORM_STM32F7)
void UARTDevice::interruptService() {

    // Interrupcio TXEFE (FIFO/TX empty)
    //
    if ((_usart->CR1 & USART_CR1_TXEIE) && (_usart->ISR & USART_ISR_TXE)) {

        if (_txCount < _txSize) {
            _usart->TDR = _txBuffer[_txCount++];
            if (_txCount == _txSize)
                ATOMIC_MODIFY_REG(_usart->CR1, USART_CR1_TXEIE, USART_CR1_TCIE);
        }
    }

    // Interrupcio TC (Transmission complete). Nomes en l'ultim caracter transmes
    //
    if ((_usart->CR1 & USART_CR1_TCIE) && (_usart->ISR & USART_ISR_TC)) {

        _usart->ICR |= USART_ICR_TCCF;
        ATOMIC_CLEAR_BIT(_usart->CR1, USART_CR1_TXEIE | USART_CR1_TCIE | USART_CR1_TE);
        notifyTxCompleted(_txBuffer, _txCount, true);
        _state = State::ready;
    }

    /// Interupcio FIFO/RD not empty
    //
    if ((_usart->CR1 & USART_CR1_RXNEIE) && (_usart->ISR & USART_ISR_RXNE)) {

        if (_rxCount < _rxSize) {
            _rxBuffer[_rxCount++] = _usart->RDR;
            if (_rxCount == _rxSize) {
                ATOMIC_CLEAR_BIT(_usart->CR1, USART_CR1_RXNEIE | USART_CR1_RTOIE | USART_CR1_RE);
                notifyRxCompleted(_rxBuffer, _rxCount, true);
                _state = State::ready;
            }
        }
    }

    // Interrupcio RX timeout
    //
    if ((_usart->CR1 & USART_CR1_RTOIE) && (_usart->ISR & USART_ISR_RTOF)) {

        _usart->ICR |= USART_ICR_RTOCF;
        ATOMIC_CLEAR_BIT(_usart->CR1, USART_CR1_RXNEIE | USART_CR1_RTOIE | USART_CR1_RE);
        notifyRxCompleted(_rxBuffer, _rxCount, true);
        _state = State::ready;
    }
}

#elif defined(EOS_PLATFORM_STM32G0)
void UARTDevice::interruptService() {

    // Transmissio amb el FIFO activat
    //
    if (_usart->CR1 & USART_CR1_FIFOEN) {

    }

    // Transmissio amb el FIFO desactivat.
    ///
    else {

        // Interrupcio 'TxEmpty'
        //
        if (isTxEmptyInterruptEnabled(_usart) & isTxEmpty(_usart)) {
            if (_txCount < _txSize) {
                write8(_usart, _txBuffer[_txCount++]);
                if (_txCount == _txSize)
                    ATOMIC_MODIFY_REG(_usart->CR1, USART_CR1_TXEIE_TXFNFIE, USART_CR1_TCIE);
            }
        }

        // Interrupcio 'TxComplete'. Nomes en l'ultim caracter transmes
        //
        if (isTxCompleteInterruptEnabled(_usart) && isTxComplete(_usart)) {
            _usart->ICR |= USART_ICR_TCCF;
            ATOMIC_CLEAR_BIT(_usart->CR1, USART_CR1_TXEIE_TXFNFIE | USART_CR1_TCIE | USART_CR1_TE);
            ATOMIC_CLEAR_BIT(_usart->CR3, USART_CR3_DMAT);
            notifyTxCompleted(_txBuffer, _txCount, true);
            _state = State::ready;
        }

        /// Interupcio 'RxNotEmpty'
        //
        if (isRxNotEmptyInterruptEnabled(_usart) && isRxNotEmpty(_usart)) {
            if (_rxCount < _rxSize) {
                _rxBuffer[_rxCount++] = read8(_usart);
                if (_rxCount == _rxSize) {
                    ATOMIC_CLEAR_BIT(_usart->CR1, USART_CR1_RXNEIE_RXFNEIE | USART_CR1_RTOIE | USART_CR1_RE);
                    notifyRxCompleted(_rxBuffer, _rxCount, true);
                    _state = State::ready;
                }
            }
        }

        // Interrupcio 'RxTimeout'
        //
        if ((_usart->CR1 & USART_CR1_RTOIE) && (_usart->ISR & USART_ISR_RTOF)) {
            _usart->ICR |= USART_ICR_RTOCF;
            ATOMIC_CLEAR_BIT(_usart->CR1, USART_CR1_RXNEIE_RXFNEIE | USART_CR1_RTOIE | USART_CR1_RE);
            notifyRxCompleted(_rxBuffer, _rxCount, true);
            _state = State::ready;
        }
    }
}
#endif


