Rafa350/EOS/v2/Source/HTL/STM32/htlUART.cpp
    switch (clockSource) {
        case ClockSource::pclk:
            #if defined(EOS_PLATFORM_STM32F4) || defined(EOS_PLATFORM_STM32F7)
            if ((uint32_t(usart) == USART1_BASE) ||
                (uint32_t(usart) == USART6_BASE))
                return clock::getClockFrequency(clock::ClockID::pclk2);
            else
            #endif
                return clock::getClockFrequency(clock::ClockID::pclk);

        case ClockSource::sysclk:
            return clock::getClockFrequency(clock::ClockID::sysclk);

        #if defined(EOS_PLATFORM_STM32F4) || defined(EOS_PLATFORM_STM32F7)
        case ClockSource::hsi:
            return clock::getClockFrequency(clock::ClockID::hsi);
        #endif

        #if defined(EOS_PLATFORM_STM32G0)
        case ClockSource::hsi16:
            return clock::getClockFrequency(clock::ClockID::hsi16);
        #endif

        case ClockSource::lse:
            return clock::getClockFrequency(clock::ClockID::lse);

        default:
            return 0;
    }
}


/// ----------------------------------------------------------------------
/// \brief    Configura la paritat.
/// \param    usart: Registres de hardware del dispositiu.
/// \param    parity: Opcions de paritat.
///
static void setParity(
    USART_TypeDef *usart,
    Parity parity) {

    auto tmp = usart->CR1;
    switch (parity) {
        case Parity::none:
            tmp &= ~USART_CR1_PCE;
            break;

        case Parity::even:
            tmp |= USART_CR1_PCE;
            tmp &= ~USART_CR1_PS;
            break;

        case Parity::odd:
            tmp |= USART_CR1_PCE;
            tmp |= USART_CR1_PS;
            break;
    }
    usart->CR1 = tmp;
}


/// ----------------------------------------------------------------------
/// \brief    Configura el nombre de bits de parada
/// \param    usart: Registres de harware del dispositiu.
/// \param    stopBits: Opcions dels bits de parada.
///
static void setStopBits(
    USART_TypeDef *usart,
    StopBits stopBits) {

    auto tmp = usart->CR2;
    switch (stopBits) {
        case StopBits::_0p5:
            tmp &= ~USART_CR2_STOP_1;
            tmp |= USART_CR2_STOP_0;
            break;

        case StopBits::_1:
            tmp &= ~USART_CR2_STOP_1;
            tmp &= ~USART_CR2_STOP_0;
            break;

        case StopBits::_1p5:
            tmp |= USART_CR2_STOP_1;
            tmp |= USART_CR2_STOP_0;
            break;

        case StopBits::_2:
            tmp |= USART_CR2_STOP_1;
            tmp &= ~USART_CR2_STOP_0;
            break;
    }
    usart->CR2 = tmp;
}


/// ----------------------------------------------------------------------
/// \brief    Configura nombre de bits de paraula.
/// \param    usart: Registres de herdware del dispositiu.
/// \param    wordBits: Opcions dels bits de paraula.
/// \params   useParity: True si utilitza bit de paritat
///
static void setWordBits(
    USART_TypeDef *usart,
    WordBits wordBits,
    bool useParity) {

    auto numBits = 7 + uint32_t(wordBits) + (useParity ? 0 : 1);

    auto tmp = usart->CR1;
    switch (numBits) {
        #if defined(EOS_PLATFORM_STM32F4) || defined(EOS_PLATFORM_STM32F7)
        case 7:
            tmp |= USART_CR1_M1;
            tmp &= ~USART_CR1_M0;
            break;
        #endif

        case 8:
            #if defined(EOS_PLATFORM_STM32F4) || defined(EOS_PLATFORM_STM32F7)
            tmp &= ~USART_CR1_M1;
            tmp &= ~USART_CR1_M0;
            #else
            tmp &= ~USART_CR1_M;
            #endif
            break;

        case 9:
            #if defined(EOS_PLATFORM_STM32F4) || defined(EOS_PLATFORM_STM32F7)
            tmp &= ~USART_CR1_M1;
            tmp |= USART_CR1_M0;
            #else
            tmp |= USART_CR1_M;
            #endif
            break;
    }
    usart->CR1 = tmp;
}


/// ----------------------------------------------------------------------
/// \brief    Configura el protocol.
/// \param    usart: Registres de hardware del dispositiu.
/// \param    handsake: Opcions de protocol.
///
static void setHandsake(
    USART_TypeDef *usart,
    Handsake handsake) {

    auto tmp = usart->CR3;
    switch (handsake) {
        case Handsake::none:
            tmp &= ~(USART_CR3_RTSE | USART_CR3_CTSE);
            break;

        case Handsake::ctsrts:
            tmp |= (USART_CR3_RTSE | USART_CR3_CTSE);
            break;
    }
    usart->CR3 = tmp;
}


/// ----------------------------------------------------------------------
/// \brief    Configura el timeout per recepcio.
/// \param    usart: Registres de hardware del dispositiu.
/// \param    timeout: Timeout en temps de bit individual.
///
static void setReceiveTimeout(
    USART_TypeDef *usart,
    uint32_t timeout) {

    if (timeout == 0)
        usart->CR2 &= ~USART_CR2_RTOEN;
    else {
        usart->CR2 |= USART_CR2_RTOEN;
        usart->RTOR = timeout;
    }
}


/// ----------------------------------------------------------------------
/// \brief    Comprova si esta habilitada la interrupcio TxEmpty
/// \param    usart: Els registres de hardware del dispositiu.
/// \return   True si esta habilitada.
///
static bool isTxEmptyInterruptEnabled(
    USART_TypeDef *usart) {

    #if defined(EOS_PLATFORM_STM32F4) || defined(EOS_PLATFORM_STM32F7)
    return (usart->CR1 & USART_CR1_TXEIE) != 0;
    #elif defined(EOS_PLATFORM_STM32G0)
    return (usart->CR1 & USART_CR1_TXEIE_TXFNFIE) != 0;
    #else
    #error "Unknown platform"
    #endif
}


/// ----------------------------------------------------------------------
/// \brief    Comprova si esta habilitada la interrupcio 'TxCompleted'.
/// \param    usart: Els registres de hardware del dispositiu.
/// \return   True si esta habilitada.
///
static bool isTxCompleteInterruptEnabled(
    USART_TypeDef *usart) {

    return (usart->CR1 & USART_CR1_TCIE) != 0;
}


/// ----------------------------------------------------------------------
/// \brief    Comprova si esta habilitada la interrupcio 'RxNotEmpty'.
/// \param    usart: Els registres de hardware del dispositiu.
/// \return   True si esta habilitada.
///
static bool isRxNotEmptyInterruptEnabled(
    USART_TypeDef *usart) {

    #if defined(EOS_PLATFORM_STM32F4) || defined(EOS_PLATFORM_STM32F7)
    return (usart->CR1 & USART_CR1_RXNEIE) != 0;
    #elif defined(EOS_PLATFORM_STM32G0)
    return (usart->CR1 & USART_CR1_RXNEIE_RXFNEIE) != 0;
    #else
    #error "Unknown platform"
    #endif
}


