Rafa350/EOS/v2/Source/HTL/STM32/htlUART.cpp
/// ----------------------------------------------------------------------
/// \brief    Comprova si el flag 'TxEmpty' esta actiu.
/// \param    usart: Els registres de hardware del dispositiu.
/// \return   True si el flag esta actiu.
///
static bool isTxEmpty(
    USART_TypeDef *usart) {

    #if defined(EOS_PLATFORM_STM32F4) || defined(EOS_PLATFORM_STM32F7)
    return (usart->ISR & USART_ISR_TXE) != 0;
    #elif defined(EOS_PLATFORM_STM32G0)
    return (usart->ISR & USART_ISR_TXE_TXFNF) != 0;
    #else
    #error "Unknown platform"
    #endif
}


/// ----------------------------------------------------------------------
/// \brief    Comprova si el flag 'TxCompleted' esta actiu.
/// \param    usart: Els registres de hardware del dispositiu.
/// \return   True si el flag esta actiu.
///
static bool isTxComplete(
    USART_TypeDef *usart) {

    return (usart->ISR & USART_ISR_TC) != 0;
}


/// ----------------------------------------------------------------------
/// \brief    Comprova si el flag 'RxNotEmpty' esta actiu.
/// \param    usart: Els registres de hardware del dispositiu.
/// \return   True si el flag esta actiu.
///
static bool isRxNotEmpty(
    USART_TypeDef *usart) {

    #if defined(EOS_PLATFORM_STM32F4) || defined(EOS_PLATFORM_STM32F7)
    return (usart->ISR & USART_ISR_RXNE) != 0;
    #elif defined(EOS_PLATFORM_STM32G0)
    return (usart->ISR & USART_ISR_RXNE_RXFNE) != 0;
    #else
    #error "Unknown platform"
    #endif
}


/// ----------------------------------------------------------------------
/// \brief    Transmiteix un byte.
/// \param    usart: Els registres de hardware del dispositiu.
/// \param    data: El byte a transmetre.
///
static void write8(
    USART_TypeDef *usart,
    uint8_t data) {

    usart->TDR = data;
}


/// ----------------------------------------------------------------------
/// \brief    Reb un byte.
/// \param    usart: Els registres de hardware del dispositiu.
/// \return   El byte rebut.
///
static uint8_t read8(
    USART_TypeDef *usart) {

    return  usart->RDR;
}
